<h1><center>Naive Bayes</center></h1>
<p></p>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv("D:\\Machine Learning\\titanics.csv")
df.head()

,assengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 1. Dropping the unnecessary columns.

In [3]:
df.drop(['assengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

### 2. Storing survived column in target as a series and except survived all other columns into inputs dataframe.

In [4]:
target=df.Survived
inputs=df.drop('Survived',axis='columns')

In [5]:
dummies=pd.get_dummies(inputs.Sex)
dummies

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [6]:
inputs_combined=pd.concat([inputs,dummies],axis='columns')
inputs_combined.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
inputs_combined.drop(['Sex'],axis='columns',inplace=True)
inputs_combined.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

### 3. Checking whether dataframe have NaN or missing values.

In [8]:
inputs_combined.columns[inputs_combined.isna().any()]

Index(['Age'], dtype='object')

In [9]:
inputs_combined.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

### 4. If dataframe have NaN or missing values then fill it with mean of values in respective columns.

In [10]:
inputs_combined.Age=inputs_combined.Age.fillna(inputs_combined.Age.mean())
inputs_combined.Age.head(10)

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [11]:
from sklearn.model_selection import train_test_split
X_train,X_test,Y_train,Y_test=train_test_split(inputs_combined,target,test_size=0.2)

In [12]:
len(X_train)

712

In [13]:
len(X_test)

179

### 5. Using Gaussian NB.

In [14]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [15]:
model.fit(X_train,Y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [16]:
model.score(X_test,Y_test)

0.8156424581005587

In [17]:
X_test[:10]

     Pclass        Age      Fare  female  male
435       1  14.000000  120.0000       1     0
869       3   4.000000   11.1333       0     1
481       2  29.699118    0.0000       0     1
40        3  40.000000    9.4750       1     0
658       2  23.000000   13.0000       0     1
0         3  22.000000    7.2500       0     1
265       2  36.000000   10.5000       0     1
600       2  24.000000   27.0000       1     0
331       1  45.500000   28.5000       0     1
809       1  33.000000   53.1000       1     0

In [18]:
Y_test[:10]

435    1
869    1
481    0
40     0
658    0
0      0
265    0
600    1
331    0
809    1
Name: Survived, dtype: int64

In [19]:
model.predict(X_test[:10])

array([1, 0, 0, 1, 0, 0, 0, 1, 0, 1], dtype=int64)